#!/usr/bin/python
# -*- coding: utf-8 -*-

"""
Created on Tue Jan  7 21:46:54 2020

@author: ingrida grigonyte
"""


def get_message(msg):

    msgs = {
        'msg_1': 'Невалиден вход!',
        'msg_2': 'Моля, въведете номер!',
        'msg_3': 'Моля, въведете само арабски или римски номера!',
        'msg_4': 'Числото е твърде голямо за преобразуването на арабски в римски числа!',
        'msg_5': 'Римляните нямаха нула! Не е чудно, че те се сринаха. ',
        'msg_6': 'Невалидна комбинация от римски цифри.',
        'msg_7': 'Римският номер е: ',
        'msg_8': 'Арабски номер е: ',
        'msg_10': 'Въведете номер: ',
        }

    result = None
    for i in msgs:
        if i == msg:
            result = msgs.get(msg)
    return result
